app/services/batch_import_service.rb

  def create_denied_member(member, reason, effectivity = nil)
    denied_member = DeniedMember.find_or_create_by!(
      name: "#{member.first_name} #{member.middle_name} #{member.last_name}",
      age: member.birth_date.nil? ? 0 : member.age(effectivity),
      group_remit: @group_remit
    )
---
SELECT `members`.* FROM `members` WHERE `members`.`first_name` = 'IMELDA' AND `members`.`last_name` = 'PAULS' AND `members`.`middle_name` = 'CECILE' LIMIT 1