app/services/batch_import_service.rb

  def initialize(spreadsheet, group_remit, cooperative)
    @spreadsheet = spreadsheet
    @group_remit = group_remit
    @cooperative = cooperative
    @agreement = @group_remit.agreement
    @gyrt_plans = ['GYRT', 'GYRTF']
    @gyrt_ranking_plans = ['GYRTBR', 'GYRTFR']
    @gyrt_family_plans = ['GYRTF', 'GYRTFR']
    @special_term_insurance = ['PMFC']
    @principal_headers = ["First Name", "Middle Name", "Last Name", "Birthdate", "Transferred?"]
    @principal_headers << "Rank" if @gyrt_ranking_plans.include?(@agreement.plan.acronym)
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 2 LIMIT 1

  def create_denied_member(member, reason, effectivity = nil)
    DeniedMember.find_or_create_by!(
      name: "#{member.first_name} #{member.middle_name} #{member.last_name}",
      age: member.birth_date.nil? ? 0 : member.age(effectivity),
      reason: reason,
      group_remit: @group_remit
    )
---
INSERT INTO `denied_members` (`name`, `age`, `reason`, `group_remit_id`, `created_at`, `updated_at`) VALUES ('HORTEN MYRON GRAMMER', 72, 'Age not within agreement\'s age range', 3, '2023-07-07 11:10:45.297938', '2023-07-07 11:10:45.297938')
SELECT `denied_members`.* FROM `denied_members` WHERE `denied_members`.`name` = 'HORTEN MYRON GRAMMER' AND `denied_members`.`age` = 72 AND `denied_members`.`reason` = 'Age not within agreement\'s age range' AND `denied_members`.`group_remit_id` = 3 LIMIT 1