app/services/batch_import_service.rb

SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2 AND `agreement_benefits`.`name` = 'OPTION 1' LIMIT 1
---
        )
        insured_type = batch_dependent.insured_type(dependent.relationship)

        dependent_agreement_benefits = agreement_benefits.where("name LIKE ?", "%#{batch.agreement_benefit.name}%").find_by(insured_type: insured_type)