app/services/member_import_service.rb

      # Extract cooperative member data from CSV row
      begin
        coop_member_hash = {
          cooperative_id: @cooperative.id,
          coop_branch_id: @cooperative.coop_branches.find_by(name: row["Branch"].strip).id,
          membership_date: row["Membership Date"]
---
SELECT `coop_branches`.* FROM `coop_branches` WHERE `coop_branches`.`name` = 'pmfc branch 1' LIMIT 1



      # Check if a member with the same first name, last name, and birth date already exists
      member = Member.find_or_initialize_by(
        first_name: member_hash[:first_name],
        last_name: member_hash[:last_name],
        birth_date: member_hash[:birth_date]
      )

      if member.persisted?
        # check if member is already a coop member
        coop_member = member.coop_members.find_or_initialize_by(cooperative_id: @cooperative.id)
---
SELECT `members`.* FROM `members` WHERE `members`.`first_name` = 'IMELDA' AND `members`.`last_name` = 'PAULS' AND `members`.`birth_date` = '2000-01-17' LIMIT 1
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`member_id` = 2 AND `coop_members`.`cooperative_id` = 2 LIMIT 1