app/services/member_import_service.rb

INSERT INTO `coop_members` (`cooperative_id`, `coop_branch_id`, `member_id`, `membership_date`, `transferred`, `created_at`, `updated_at`, `full_name`) VALUES (2, 1, 2, '1992-02-05', FALSE, '2023-07-07 10:41:52.538152', '2023-07-07 10:41:52.538152', 'PAULS, IMELDA CECILE')
---
        updated_members_counter += 1
      else
        # If a member does not exist, create a new record
        new_member = Member.create(member_hash)