app/models/concerns/calculate.rb

SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2 AND `agreement_benefits`.`id` = 6 LIMIT 1
---
		def set_premium_and_service_fees(insured_type, group_remit, term_insurance = false)
			# agreement_benefit = group_remit.agreement.agreement_benefits.find_by(insured_type: insured_type)
			agreement_benefit = group_remit.agreement.agreement_benefits.find_by(id: insured_type)

SELECT SUM(`product_benefits`.`premium`) FROM `product_benefits` WHERE `product_benefits`.`agreement_benefit_id` = 6
---
		def total_premium
			# byebug
			agreement_benefit.product_benefits.sum(:premium)