app/workers/group_remit_status_updater.rb

SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`status` IN (4) AND (expiry_date <= '2023-07-10')
---
  def perform
    expired_group_remit = GroupRemit.where(status: :paid)
      .where("expiry_date <= ?", Date.current)

    expired_group_remit.each do |gr|