app/views/coop_members/index.html.erb

SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`member_id` = 9 AND `coop_members`.`cooperative_id` = 2 LIMIT 1
---
      <% @filtered_members.each do |member| %>
        <% coop_member = member.coop_members.find_by(cooperative_id: @cooperative.id)%>