app/views/coop_members/member_agreements.html.erb

		<% else %>
			<% group_remit = agreement.group_remits.last %>
---
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`agreement_id` = 2 ORDER BY `group_remits`.`id` DESC LIMIT 1

    	<% gr_presenter = GroupRemitPresenter.new(group_remit) %>
		<% batch = group_remit.batches.find_by(coop_member_id: @coop_member.id) %>
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3 AND `batches`.`coop_member_id` = 19 LIMIT 1


						<% if batch.batch_beneficiaries.exists? %>
---
SELECT `batch_beneficiaries`.* FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` = 16
SELECT 1 AS one FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` = 24 LIMIT 1

							<tbody>
								<% beneficiaries = batch.batch_beneficiaries.includes(:member_dependent) %>
---
SELECT `batch_beneficiaries`.* FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` = 16
SELECT `member_dependents`.* FROM `member_dependents` WHERE `member_dependents`.`id` IN (9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24)

								<% batch_benefits = agreement.plan.acronym == 'PMFC' ? batch.get_term_insurance_product_benefit : benefit.product_benefits %>
								<% batch_benefits.includes(:benefit).each do |product| %>
---
SELECT `benefits`.* FROM `benefits` WHERE `benefits`.`id` IN (1, 2, 3)

						<% if agreement.plan.gyrt_type == 'family' %>
							<% batch.batch_dependents.includes(:member_dependent, :agreement_benefit).each do |dependent| %>
---
SELECT `batch_dependents`.* FROM `batch_dependents` WHERE `batch_dependents`.`batch_id` = 16


										<% dependent_benefits.includes(:benefit).each do |product| %>
---
SELECT `benefits`.* FROM `benefits` WHERE `benefits`.`id` IN (1, 2, 3)