app/views/group_remits/_coverages_modal.html.erb

SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2
SELECT `benefits`.* FROM `benefits` WHERE `benefits`.`id` IN (1, 2, 3)
---
        <div class="accordion" id="accordionExample">
          <% @agreement.agreement_benefits.where.not(insured_type: 2..5).includes({product_benefits: :benefit}).each do |ab| %>

SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2
---
                  <%= render 'benefits_table', ab: ab %>
                  <% @agreement.agreement_benefits.where("name LIKE ?", "%#{ab.name}%").drop(1).each do |db| %>