app/views/group_remits/_member_count_modal.html.erb

SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2
SELECT `benefits`.* FROM `benefits` WHERE `benefits`.`id` IN (1, 2, 3)
---

        <% @agreement.agreement_benefits.includes({product_benefits: :benefit}).each do |ab| %>

SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3 AND `batches`.`agreement_benefit_id` = 6
---

            <%= content_tag :span, "#{@group_remit.batches.where(agreement_benefit_id: ab.id).length}", class: 'text-secondary text-center', style: 'font-size: .8rem; width: 150px;' %>