app/views/group_remits/show.html.erb

SELECT `denied_members`.* FROM `denied_members` WHERE `denied_members`.`group_remit_id` = 3
---

      <%  if @group_remit.denied_members.present? %>

SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`agreement_id` = 1
---
    <% if plan_acronym == 'PMFC' %>
      <%= "#{@agreement.moa_no} - BATCH #{@agreement.group_remits.find_index(@group_remit) + 1}" %>

SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2 AND NOT (`agreement_benefits`.`insured_type` BETWEEN 2 AND 5)
---

      <% @group_remit.agreement.agreement_benefits.where.not(insured_type: 2..5).each do |a_benefit| %>

SELECT 1 AS one FROM `batches` WHERE `batches`.`group_remit_id` = 3 LIMIT 1
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3 ORDER BY `batches`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`id` IN (9, 8, 7, 6)
SELECT `batch_beneficiaries`.* FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` IN (24, 23, 22, 21, 20, 19, 18, 17)
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` IN (19, 18, 17, 16, 15, 14, 13, 12)
SELECT `members`.* FROM `members` WHERE `members`.`id` IN (2, 3, 4, 5, 6, 7, 8, 9)
---

      <% if @group_remit.batches.exists? %>
        <%= render @batches.includes([coop_member: :member], :agreement_benefit, :batch_beneficiaries), group_remit: @group_remit, agreement: @agreement %>