app/views/process_claims/_form.html.erb

SELECT `acronym`, `name`, `product_benefits`.`coverage_amount` FROM `product_benefits` INNER JOIN `benefits` ON `benefits`.`id` = `product_benefits`.`benefit_id` WHERE `product_benefits`.`agreement_benefit_id` = 9
---
        <div class="<%= flex_justify_align('around', 'center') %> ps-3">
          <% claim_options = @batch.agreement_benefit.product_benefits.joins(:benefit).pluck(:acronym, :name, :coverage_amount) %>