app/views/process_claims/show.html.erb

<% @process_claim.claim_documents.each do |claims| %>
---
SELECT `claim_documents`.* FROM `claim_documents` WHERE `claim_documents`.`process_claim_id` = 28