app/views/batch_beneficiaries/_form.html.erb

SELECT `member_dependents`.* FROM `member_dependents` WHERE `member_dependents`.`member_id` = 9 AND `member_dependents`.`id` != 9
---
    <% else %>
      <%= f.association :member_dependent,
        collection: @beneficiaries.map { |d| ["#{d.last_name}, #{d.first_name} #{d.middle_name} - #{d.relationship}", d.id]},
        label: false