app/views/coop_agreements/_history.html.erb

<% if !@agreement.group_remits.blank? %>
---
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`agreement_id` = 1 ORDER BY `group_remits`.`created_at` DESC