app/views/coop_agreements/index.html.erb

SELECT `anniversaries`.* FROM `anniversaries` WHERE `anniversaries`.`agreement_id` = 2
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`agreement_id` = 2
---
                  <% if agreement.anniversary_type == 'multiple' %>
                    <% agreement.anniversaries.each do |anniv| %>
                      <% if anniv.group_remits.blank? %>

SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`cooperative_id` = 2 AND (moa_no LIKE '%%') ORDER BY `agreements`.`updated_at` DESC
SELECT 1 AS one FROM `agreements` WHERE `agreements`.`cooperative_id` = 2 LIMIT 1
---

<% unless @cooperative.agreements.exists? %>