app/views/coop_agreements/show.html.erb

<div class="mb-3 d-flex text-primary gap-3">
  <%= content_tag :h4, @agreement.plan.acronym.include?("GYRT") ? "GROUP YEARLY RENEWABLE TERM" : @agreement.plan.name %>
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 2 LIMIT 1