app/views/batches/_batch.html.erb

    <% batch_presenter = BatchPresenter.new(batch)%>
    <% product_benefit = batch.agreement_benefit.product_benefits.select {|pb| pb.benefit.acronym == "LI" } %>
---
SELECT `product_benefits`.* FROM `product_benefits` WHERE `product_benefits`.`agreement_benefit_id` = 6
SELECT `benefits`.* FROM `benefits` WHERE `benefits`.`id` = 1 LIMIT 1