app/views/batches/_batch_display.html.erb

SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 9 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`id` = 9 LIMIT 1
---
          <div class="col-sm-2 text-secondary">
            <%= "#{batch_member.member.first_name}" %>

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 1 LIMIT 1
---
<div class="row <%= flex_justify_align('center') %>">
  <% if (@agreement.plan.gyrt_type.present? && @agreement.plan.gyrt_type == 'basic') || !@batch.agreement_benefit.with_dependent? %>

SELECT COUNT(*) FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` = 16
SELECT `batch_beneficiaries`.* FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` = 16
---
                <% if (@group_remit.pending? || @group_remit.for_renewal?) && @group_remit.instance_of?(Remittance) %>
                  <% if @batch.batch_beneficiaries.size < 4 %>

SELECT COUNT(*) FROM `batch_dependents` WHERE `batch_dependents`.`batch_id` = 16
SELECT `batch_dependents`.* FROM `batch_dependents` WHERE `batch_dependents`.`batch_id` = 16
---
                  <% if (@group_remit.pending? ||  @group_remit.for_renewal?) && @group_remit.instance_of?(Remittance) %>
                    <% if @batch.batch_dependents.size < 4 %>