app/views/batches/_batch_status.html.erb

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 2 LIMIT 1
---

<% if agreement.plan.acronym.include?('GYRT') %>