app/views/batches/_member_details.html.erb


	<% if batch.status == 'recent' && batch.batch_health_decs.blank? %>
---
SELECT `batch_health_decs`.* FROM `batch_health_decs` WHERE `batch_health_decs`.`batch_id` = 18