app/controllers/application_controller.rb

  def set_cooperative
    if current_user && current_user.userable_type == 'CoopUser'
      session[:c_id] ||= current_user.userable.cooperative_id
      @cooperative ||= Cooperative.find_by(id: session[:c_id])
---
SELECT `cooperatives`.* FROM `cooperatives` WHERE `cooperatives`.`id` = 1 LIMIT 1