app/controllers/batches_controller.rb

    def set_group_remit_and_agreement
      @group_remit = GroupRemit.find_by(id: params[:group_remit_id])
---
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`id` = 3 LIMIT 1

    def set_batch
      set_group_remit_and_agreement
      @batch = @group_remit.batches.find_by(id: params[:id])
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 2 AND `batches`.`id` = 16 LIMIT 1