app/controllers/batches_controller.rb

      }

      # Find member in the database using their name
      member = Member.find_or_initialize_by(
        first_name: batch_hash[:first_name],
        last_name: batch_hash[:last_name],
        middle_name: batch_hash[:middle_name]
      )
---
SELECT `members`.* FROM `members` WHERE `members`.`first_name` = 'IMELDA' AND `members`.`last_name` = 'PAULS' AND `members`.`middle_name` = 'CECILE' LIMIT 1

      member_age = Date.today.year - birth_date.year - ((Date.today.month > birth_date.month || (Date.today.month == birth_date.month && Date.today.day >= birth_date.day)) ? 0 : 1)

      if member_age < 18 or member_age > 65
        @denied_members_array << row
---
INSERT INTO `denied_members` (`name`, `age`, `reason`, `group_remit_id`, `created_at`, `updated_at`) VALUES ('HORTEN MYRON GRAMMER', 72, 'Age not within agreement\'s age range', 3, '2023-07-07 11:10:45.297938', '2023-07-07 11:10:45.297938')

      end

      # Get the ID of the member's cooperative membership
      coop_member_id = member.coop_members.find_by(cooperative_id: @cooperative.id).id

      # Check if the member has already been added to this remittance batch
      duplicate_member = @group_remit.batches.find_by(coop_member_id: coop_member_id)

      if duplicate_member
        # Member has already been added to this remittance batch
        @duplicate_members_array << batch_hash
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`member_id` = 2 AND `coop_members`.`cooperative_id` = 2 LIMIT 1
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3 AND `batches`.`coop_member_id` = 12 LIMIT 1
INSERT INTO `batches` (`effectivity_date`, `expiry_date`, `active`, `coop_sf_amount`, `agent_sf_amount`, `status`, `created_at`, `updated_at`, `premium`, `age`, `insurance_status`, `coop_member_id`, `group_remit_id`, `transferred`, `agreement_benefit_id`, `valid_health_dec`, `below_nel`, `duration`, `residency`) VALUES (NULL, NULL, NULL, 41.875, 33.5, 2, '2023-07-07 11:10:44.294116', '2023-07-07 11:10:44.294116', 335.0, 23, 3, 12, 3, NULL, 6, FALSE, FALSE, NULL, NULL)

        premium = @group_remit.agreement.agreement_benefits.find_by(insured_type: 1).product_benefit.premium
        coop_sf = @group_remit.agreement.agreement_benefits[0].proposal.coop_sf
        agent_sf = @group_remit.agreement.agreement_benefits[0].proposal.agent_sf
        terms = new_batch.group_remit.terms
---
SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`agreement_id` = 2 AND `agreement_benefits`.`id` = 6 LIMIT 1


        agreement = @group_remit.agreement
        coop_member = new_batch.coop_member
        renewal_member = agreement.coop_members.find_by(id: coop_member.id)
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 12 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`id` = 2 LIMIT 1

          new_batch.status = :renewal
        else
          new_batch.status = :recent
          agreement.coop_members << coop_member
---
INSERT INTO `agreements_coop_members` (`agreement_id`, `coop_member_id`) VALUES (2, 12)

  def create
    @coop_members = @cooperative.coop_members.includes(:member).order('members.last_name')
    @batch = @group_remit.batches.new(batch_params)

    agreement = @group_remit.agreement
    coop_member = @batch.coop_member
    member_details = coop_member.member
    birth_date = member_details.birth_date
    member_age = Date.today.year - birth_date.year - ((Date.today.month > birth_date.month || (Date.today.month == birth_date.month && Date.today.day >= birth_date.day)) ? 0 : 1)

    if member_age < 18 or member_age > 65
      return redirect_to new_group_remit_batch_path(@group_remit), alert: "Member age must be between 18 and 65 years old."
    end

    renewal_member = agreement.coop_members.find_by(id: coop_member.id)
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1

    def set_group_remit
      @cooperative = current_user.userable.cooperative
      @group_remit = GroupRemit.find_by(id: params[:group_remit_id])
---
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`id` = 3 LIMIT 1

    def set_batch
      set_cooperative
      @group_remit = GroupRemit.find_by(id: params[:group_remit_id])
      @batch = @group_remit.batches.find_by(id: params[:id])
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 2 AND `batches`.`id` = 16 LIMIT 1

    def set_premiums
      @agreement = @group_remit.agreement
      @batches_container = @group_remit.batches.order(created_at: :desc)
      @batches_dependents= BatchDependent.joins(batch: :group_remit)
        .where(group_remits: {id: @group_remit.id})

      # premium and commission totals
      batch_dependent_premiums = @group_remit.batches.joins(:batch_dependents).sum('batch_dependents.premium')
      @gross_premium = @group_remit.batches.sum(:premium) + batch_dependent_premiums
      @total_coop_commission = @group_remit.batches.sum(:coop_sf_amount)
      @total_agent_commission = @group_remit.batches.sum(:agent_sf_amount)
      @net_premium = @gross_premium - @total_coop_commission

      @principal_count = @batches_container.count
      @dependent_count = @batches_dependents.count
      @single_premium = @batches_container[0].premium if @batches_container[0].present?
      @single_dependent_premium = @batches_dependents[0].premium if @batches_dependents[0].present?
---
SELECT `batch_dependents`.* FROM `batch_dependents` WHERE `batch_dependents`.`batch_id` = 16
SELECT COUNT(*) FROM `batch_dependents` WHERE `batch_dependents`.`batch_id` = 16
SELECT 1 AS one FROM `batch_dependents` WHERE `batch_dependents`.`batch_id` = 17 LIMIT 1