app/controllers/batch_beneficiaries_controller.rb

INSERT INTO `batch_beneficiaries` (`batch_id`, `member_dependent_id`, `created_at`, `updated_at`) VALUES (16, 9, '2023-07-07 11:52:31.243627', '2023-07-07 11:52:31.243627')
---
  def create
    @batch_beneficiary = @batch.batch_beneficiaries.new(batch_beneficiary_params)

    respond_to do |format|
      if @batch_beneficiary.save

SELECT `cooperatives`.* FROM `cooperatives` WHERE `cooperatives`.`id` = 1 LIMIT 1
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 2 AND `batches`.`id` = 16 LIMIT 1
---
    def set_group_remit_batch
      @cooperative = current_user.userable.cooperative
      @group_remit = @cooperative.group_remits.find(params[:group_remit_id])
      @batch = @group_remit.batches.find(params[:batch_id])