app/controllers/coop_members_controller.rb

SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 19 LIMIT 1
---
  def find_member
    # @member = Member.find_by(id: params[:id])
    @member = CoopMember.find_by(id: params[:id])

SELECT `agreements`.* FROM `agreements` INNER JOIN `agreements_coop_members` ON `agreements`.`id` = `agreements_coop_members`.`agreement_id` WHERE `agreements_coop_members`.`coop_member_id` = 19
---
  def member_agreements
    # byebug
    @agreements = @coop_member.agreements.includes(:plan)