app/controllers/coop_members_controller.rb

  def index
    # ransack gem for search
    # coop member id
    @member = Member.new
    @member.coop_members.build
    # get all coop members of the cooperative
    @coop_members = CoopMember.where(cooperative_id: @cooperative.id)
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`member_id` = 9 AND `coop_members`.`cooperative_id` = 2 LIMIT 1

  def update
    @coop_member = CoopMember.find(params[:id])
---
SELECT `members`.* FROM `members` WHERE `members`.`id` = 9 LIMIT 1

  def show
    @coop_member = CoopMember.find(params[:id])
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 19 LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`id` = 9 LIMIT 1

  def selected
    @target = params[:target]
    @member = CoopMember.find(params[:id]).member
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 19 LIMIT 1