app/controllers/coop_agreements_controller.rb

  def show
    @group_remits_eager = @agreement.group_remits.joins(:anniversary)
    # @group_remits = @agreement.group_remits.order(created_at: :desc)
    @coop_sf = @agreement.coop_sf
    if @agreement.anniversary_type == 'multiple'
      @filtered_anniversaries = @agreement.get_filtered_anniversaries(@agreement.group_remits.expiry_dates)
---
SELECT `anniversaries`.* FROM `anniversaries` WHERE `anniversaries`.`agreement_id` = 2
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`agreement_id` = 2 ORDER BY `group_remits`.`id` DESC LIMIT 1

    def set_agreement
      @agreement = Agreement.find(params[:id])
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1