app/controllers/group_remits_controller.rb

INSERT INTO `group_remits` (`name`, `description`, `agreement_id`, `anniversary_id`, `created_at`, `updated_at`, `effectivity_date`, `expiry_date`, `terms`, `status`, `gross_premium`, `net_premium`, `coop_commission`, `agent_commission`) VALUES (NULL, NULL, 2, NULL, '2023-07-07 11:10:09.733348', '2023-07-07 11:10:09.733348', NULL, '2024-07-07', 12, 0, NULL, NULL, NULL, NULL)
---
  def create
    @agreement = Agreement.find_by(id: params[:agreement_id])

    if params[:anniversary_id].present?
      pending_remittance = @agreement.group_remits.where(status: [:pending, :for_renewal]).remittances.where(anniversary_id: params[:anniversary_id]).last
    else
      pending_remittance = @agreement.group_remits.where(status: [:pending, :for_renewal]).remittances.last
    end

    if pending_remittance.present?
      return redirect_to coop_agreement_group_remit_path(@agreement, pending_remittance), alert: "Please complete the pending list first."
    end

    @group_remit = @agreement.group_remits.build(type: "Remittance")
    anniversary_date = set_anniversary(@agreement.anniversary_type, params[:anniversary_id])

    GroupRemit.process_group_remit(@group_remit, anniversary_date, params[:anniversary_id])

    respond_to do |format|
      if @group_remit.save!
        # if @group_remit.plan.acronym == "LPPI"
        #   @group_remit.create_notification
        # end

        if params[:type] == "BatchRemit"
          batch_remit = @agreement.group_remits.build(type: "BatchRemit")

          GroupRemit.process_group_remit(batch_remit, anniversary_date, params[:anniversary_id])

          batch_remit.save!