app/controllers/group_remits_controller.rb

  def submit
    if @group_remit.batches.empty?
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3

  def index
    @agreement = Agreement.find_by(id: params[:agreement_id])
    @group_remits = @agreement.group_remits
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1

  def create
    # byebug
    @agreement = Agreement.find_by(id: params[:agreement_id])
    short_term_insurance = @agreement.plan.acronym == 'PMFC'

    if short_term_insurance && params[:group_remit][:terms].blank?
      return redirect_to coop_agreement_path(@agreement), alert: 'Please select a term duration'
    end

    @group_remit = @agreement.group_remits.build
    anniversary_date = set_anniversary(@agreement.anniversary_type, params[:anniversary_id])
    @group_remit.set_terms_and_expiry_date(anniversary_date)
    @group_remit.type = 'Remittance'

    if @agreement.anniversary_type == 'multiple' || @agreement.anniversary_type == 'single'
      @group_remit.anniversary_id = params[:anniversary_id]
    end

    set_group_remit_names_and_terms(@group_remit, short_term_insurance)

    respond_to do |format|
      if @group_remit.save!

        if params[:type] == 'BatchRemit'
          batch_remit = @agreement.group_remits.build(type: 'BatchRemit')
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1
INSERT INTO `group_remits` (`name`, `description`, `agreement_id`, `anniversary_id`, `created_at`, `updated_at`, `effectivity_date`, `expiry_date`, `terms`, `status`, `gross_premium`, `net_premium`, `coop_commission`, `agent_commission`) VALUES (NULL, NULL, 2, NULL, '2023-07-07 11:10:09.733348', '2023-07-07 11:10:09.733348', NULL, '2024-07-07', 12, 0, NULL, NULL, NULL, NULL)

  def payment
    if params[:file].nil?
      return redirect_to coop_agreement_group_remit_path(@group_remit.agreement, @group_remit), alert: "Please attach proof of payment"
    end

    agreement = @group_remit.agreement
    anniv_type = agreement.anniversary_type
    @group_remit.payments.build(receipt: params[:file])
    @group_remit.status = :payment_verification
    # @group_remit.effectivity_date = Date.today

    respond_to do |format|
      if @group_remit.save!
        approved_batches = @group_remit.batches.where(insurance_status: :approved)
        approved_members = CoopMember.joins(:batches)
                            .where(batches: { id: approved_batches })
                            .distinct.pluck(:id)

        # agreement.coop_members << approved_members
        current_batch_remit = GroupRemit.find(@group_remit.batch_remit_id)
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`id` = 3 LIMIT 1

    def set_group_remit
      @group_remit = GroupRemit.includes(:batches).find(params[:id])
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3 ORDER BY `batches`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`id` = 3 LIMIT 1

    def load_batches
      batches_eager_loaded = @group_remit.batches.includes(
        {coop_member: :member, batch_dependents: :member_dependent, batch_beneficiaries: :member_dependent},
        :batch_health_decs,
        :agreement_benefit
      ).order(created_at: :desc)
---
SELECT `agreement_benefits`.* FROM `agreement_benefits` WHERE `agreement_benefits`.`id` IN (9, 8, 7, 6)
SELECT `batch_health_decs`.* FROM `batch_health_decs` WHERE `batch_health_decs`.`batch_id` IN (24, 23, 22, 21, 20, 19, 18, 17)
SELECT `benefits`.* FROM `benefits` WHERE `benefits`.`id` IN (1, 2, 3)
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` IN (19, 18, 17, 16, 15, 14, 13, 12)