app/controllers/group_remits_controller.rb

  def show
    @agreement = @group_remit.agreement
    @batches_dependents= @group_remit.batches_dependents
    @batches_container = @group_remit.batches.order(created_at: :desc)
    @pagy, @batches = pagy(@batches_container, items: 10)

    @principal_count = @batches_container.count
    @dependent_count = @batches_dependents.count
    @single_premium = @batches[0].premium if @batches[0].present?
    @single_dependent_premium = @batches_dependents[0].premium if @batches_dependents[0].present?

    @all_batches_have_beneficiaries = @group_remit.batches.all? { |batch| batch.batch_beneficiaries.exists? }
---
SELECT COUNT(*) FROM `batches` WHERE `batches`.`group_remit_id` = 3 AND `batches`.`id` NOT IN (SELECT `batches`.`id` FROM `batches` INNER JOIN `batch_beneficiaries` ON `batch_beneficiaries`.`batch_id` = `batches`.`id` WHERE `batches`.`group_remit_id` = 3)
SELECT 1 AS one FROM `batches` WHERE `batches`.`group_remit_id` = 3 LIMIT 1
SELECT 1 AS one FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` = 24 LIMIT 1
SELECT `batch_beneficiaries`.* FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`batch_id` IN (24, 23, 22, 21, 20, 19, 18, 17)