app/controllers/members_controller.rb

SELECT `coop_branches`.* FROM `coop_branches` WHERE `coop_branches`.`name` = 'pmfc branch 1' LIMIT 1
SELECT `members`.* FROM `members` WHERE `members`.`first_name` = 'IMELDA' AND `members`.`last_name` = 'PAULS' AND `members`.`birth_date` = '2000-01-17' LIMIT 1
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`member_id` = 2 AND `coop_members`.`cooperative_id` = 2 LIMIT 1
---

      # Extract cooperative member data from CSV row
      coop_member_hash = {
        cooperative_id: @cooperative.id,
        coop_branch_id: CoopBranch.find_by(name: row["Branch"]).id,
        membership_date: row["Membership Date"],
        transferred: row["Transferred?"].downcase == "yes"
      }

      # Check if a member with the same first name, last name, and birth date already exists
      member = Member.find_or_initialize_by(
        first_name: member_hash[:first_name],
        last_name: member_hash[:last_name],
        birth_date: member_hash[:birth_date]
      )

      if member.persisted?
        # check if member is already a coop member
        coop_member = member.coop_members.find_or_initialize_by(cooperative_id: @cooperative.id)

INSERT INTO `coop_members` (`cooperative_id`, `coop_branch_id`, `member_id`, `membership_date`, `transferred`, `created_at`, `updated_at`, `full_name`) VALUES (2, 1, 2, '1992-02-05', FALSE, '2023-07-07 10:41:52.538152', '2023-07-07 10:41:52.538152', 'PAULS, IMELDA CECILE')
---
        updated_members_counter += 1
      else
        # If a member does not exist, create a new record
        new_member = Member.create(member_hash)