app/controllers/member_dependents_controller.rb

INSERT INTO `member_dependents` (`last_name`, `first_name`, `middle_name`, `suffix`, `birth_date`, `relationship`, `member_id`, `created_at`, `updated_at`) VALUES ('RONG', 'RULLIAN', '', '', '2023-07-03', 'Child', 9, '2023-07-07 12:01:49.063674', '2023-07-07 12:01:49.063674')
---
  def create_beneficiary
    @member_dependent = @member.member_dependents.build(member_dependent_params)

    respond_to do |format|
      if @member_dependent.save

SELECT `group_remits`.* FROM `group_remits` WHERE `group_remits`.`id` = 2 LIMIT 1
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 2 AND `batches`.`id` = 16 LIMIT 1
---
    def set_group_remit_batch
      @group_remit = GroupRemit.find(params[:group_remit_id])
      @batch = @group_remit.batches.find(params[:batch_id])

SELECT `members`.* FROM `members` WHERE `members`.`id` = 9 LIMIT 1
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 9 LIMIT 1
---
    def set_member_dependent
      @member_dependent = @member.member_dependents.find(params[:id])