app/controllers/process_claims_controller.rb

  def index
    @process_claims = ProcessClaim.all
---
SELECT `process_claims`.* FROM `process_claims`

  def new
    @process_claim = ProcessClaim.new
    @claim_documents = @process_claim.claim_documents.build
    @coop_member = CoopMember.find(params[:coop_member_id])
    @agreement = Agreement.find(params[:agreement_id])
    @group_remit = @agreement.group_remits.joins(:batches)
                           .where(batches: { coop_member_id: @coop_member.id })
                           .order('group_remits.created_at DESC')
                           .limit(1)
                           .first
    @batch = @group_remit.batches.find_by(coop_member_id: @coop_member.id)
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 19 LIMIT 1
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1
SELECT `group_remits`.* FROM `group_remits` INNER JOIN `batches` ON `batches`.`group_remit_id` = `group_remits`.`id` WHERE `group_remits`.`agreement_id` = 2 AND `batches`.`coop_member_id` = 19 ORDER BY group_remits.created_at DESC LIMIT 1
SELECT `batches`.* FROM `batches` WHERE `batches`.`group_remit_id` = 3 AND `batches`.`coop_member_id` = 19 LIMIT 1

  def create
    @process_claim = ProcessClaim.new(process_claim_params)

    batch = Batch.find(process_claim_params[:batch_id])
    coop_member = batch.coop_member
    agreement = Agreement.find(process_claim_params[:agreement_id])
    @group_remit = agreement.group_remits.joins(:batches)
                           .where(batches: { coop_member_id: coop_member.id })
                           .order('group_remits.created_at DESC')
                           .limit(1)
                           .first

    expiry_date = @group_remit.expiry_date
    incident_date = process_claim_params[:date_incident].to_date
    difference_in_months = (expiry_date.year * 12 + expiry_date.month) - (incident_date.year * 12 + incident_date.month) if incident_date != nil
    # byebug

    if difference_in_months != nil && difference_in_months > 60
      return redirect_to new_process_claim_path, alert: "The claim cannot be processed. The incident date has passed the 5-year claim period."
    end

    respond_to do |format|
      if @process_claim.save!
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`id` = 24 LIMIT 1
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1
INSERT INTO `process_claims` (`cooperative_id`, `agreement_id`, `batch_id`, `date_incident`, `entry_type`, `created_at`, `updated_at`, `batch_beneficiary_id`, `claimant_email`, `claimant_contact_no`, `nature_of_claim`) VALUES (2, 2, 24, '2023-07-04', 'coop', '2023-07-10 11:20:26.980194', '2023-07-10 11:20:26.980194', 30, 'asdasd', 'asdasdasdsaa', NULL)
SELECT `group_remits`.* FROM `group_remits` INNER JOIN `batches` ON `batches`.`group_remit_id` = `group_remits`.`id` WHERE `group_remits`.`agreement_id` = 2 AND `batches`.`coop_member_id` = 19 ORDER BY group_remits.created_at DESC LIMIT 1
INSERT INTO `process_claims` (`cooperative_id`, `agreement_id`, `batch_id`, `date_incident`, `entry_type`, `created_at`, `updated_at`, `batch_beneficiary_id`, `claimant_email`, `claimant_contact_no`, `nature_of_claim`) VALUES (2, 2, 24, '2023-07-10', 'coop', '2023-07-10 16:52:12.845824', '2023-07-10 16:52:12.845824', 30, 'test_claimant@gmail.com', '09548423385', 0)

    def set_process_claim
      @process_claim = ProcessClaim.find(params[:id])
---
SELECT `process_claims`.* FROM `process_claims` WHERE `process_claims`.`id` = 35 LIMIT 1