app/controllers/process_claims_controller.rb

  def new
    @process_claim = ProcessClaim.new
    @claim_documents = @process_claim.claim_documents.build
    @coop_member = CoopMember.find(params[:coop_member_id])
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 19 LIMIT 1