app/controllers/process_claims_controller.rb

  def show_coop
    @agreement_benefit = AgreementBenefit.where(agreement: @process_claim.agreement)
    @claim_type_document = ClaimTypeDocument.where(claim_type: @process_claim.claim_type)
    @claim_type_document_ids = @process_claim.claim_attachments.pluck(:claim_type_document_id)
    @required_documents = @claim_type_document.where.not(id: @claim_type_document_ids)

    if @process_claim.check_voucher?
      @payout_type = @process_claim.check_voucher_request&.check_vouchers&.where(audit: [:pending_audit, :for_audit])&.last
    elsif @process_claim.debit_advice?
      @payout_type = @process_claim.check_voucher_request&.debit_advices&.where(audit: [:pending_audit, :for_audit])&.last
    end

    @audit_remarks = @payout_type&.remarks

    if @process_claim.debit_advice?
      @bank = Treasury::Account.find(@process_claim.check_voucher_request.bank_id)
---
SELECT `agreements`.* FROM `agreements` WHERE `agreements`.`id` = 2 LIMIT 1

  def create
    @process_claim = ProcessClaim.new(process_claim_params)
    batch = Batch.find(process_claim_params[:batch_id])
    coop_member = batch.coop_member
    agreement = Agreement.find(process_claim_params[:agreement_id])
    @group_remit = agreement.group_remits.joins(:batches)
                           .where(batches: { coop_member_id: coop_member.id })
                           .order("group_remits.created_at DESC")
                           .limit(1)
                           .first

    expiry_date = @group_remit.expiry_date
    incident_date = process_claim_params[:date_incident].to_date
    difference_in_months = (expiry_date.year * 12 + expiry_date.month) - (incident_date.year * 12 + incident_date.month) if incident_date != nil

    if process_claim_params[:relationship].nil?

      begin
        @process_claim.relationship = BatchBeneficiary.find(process_claim_params[:claimant_name]).member_dependent.relationship
---
SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`id` = 19 LIMIT 1

  def set_process_claim
    @process_claim = ProcessClaim.find(params[:id])
    @loan_batch = @process_claim.loan_batch if @process_claim.loan_batch.present?
---
SELECT `batches`.* FROM `batches` WHERE `batches`.`id` = 24 LIMIT 1