app/models/agreement.rb

    def get_filtered_anniversaries(expiry_dates)
			anniversaries.reject do |anniv|
				expiry_dates.include?(anniv.anniversary_date.strftime("%m-%d"))
---
SELECT `anniversaries`.* FROM `anniversaries` WHERE `anniversaries`.`agreement_id` = 2