app/models/batch.rb

  def self.process_batch(batch, group_remit, rank = nil, duration = nil)
    agreement = group_remit.agreement
    coop_member = batch.coop_member
    renewal_member = agreement.agreements_coop_members.find_by(coop_member_id: coop_member.id)

    batch.age = batch.member_details.age
    batch.effectivity_date = agreement.anniversary_type == 'single' ? Date.today : group_remit.effectivity_date
    batch.expiry_date = group_remit.expiry_date

    check_plan(agreement, batch, rank, duration)

    if renewal_member.present?
        batch.status = :renewal
        renewal_member.update!(status: 'renewal')
    else
      if agreement.transferred_date >= coop_member.membership_date
        batch.status = :transferred
      else
        batch.status = :recent
      end
      agreement.agreements_coop_members.create!(coop_member_id: coop_member.id, status: 'new')
---
INSERT INTO `agreements_coop_members` (`agreement_id`, `coop_member_id`) VALUES (2, 12)