app/models/batch.rb

  def self.process_batch(batch, group_remit, rank = nil, duration = nil)
    agreement = group_remit.agreement
    coop_member = batch.coop_member
    existing_coverages = agreement.agreements_coop_members.find_by(coop_member_id: coop_member.id)
    batch.age = batch.member_details.age
    batch.expiry_date = group_remit.expiry_date
    batch.effectivity_date = ['single', 'multiple'].include?(agreement.anniversary_type) ? Date.today : group_remit.effectivity_date
---
SELECT `coop_members`.* FROM `coop_members` INNER JOIN `agreements_coop_members` ON `coop_members`.`id` = `agreements_coop_members`.`coop_member_id` WHERE `agreements_coop_members`.`agreement_id` = 2 AND `coop_members`.`id` = 12 LIMIT 1