app/models/batch_beneficiary.rb

SELECT `batch_beneficiaries`.* FROM `batch_beneficiaries` WHERE `batch_beneficiaries`.`id` = 10 LIMIT 1
SELECT `batches`.* FROM `batches` WHERE `batches`.`id` = 16 LIMIT 1
SELECT `member_dependents`.* FROM `member_dependents` WHERE `member_dependents`.`id` = 9 LIMIT 1
---
  def to_s
    beneficiary = BatchBeneficiary.includes(:member_dependent).find(self.id)