app/models/member.rb

SELECT `coop_members`.* FROM `coop_members` WHERE `coop_members`.`member_id` = 2 AND `coop_members`.`cooperative_id` = 2 LIMIT 1
---
  def coop_member_id(coop)
    coop_members.find_by(cooperative_id: coop.id).id

SELECT `members`.`id` FROM `members` LEFT OUTER JOIN `coop_members` ON `coop_members`.`member_id` = `members`.`id` LEFT OUTER JOIN `coop_branches` ON `coop_branches`.`id` = `coop_members`.`coop_branch_id` WHERE `coop_members`.`id` IN (12, 13, 14, 15, 16, 17, 18, 19, 20, 21) ORDER BY `members`.`last_name` ASC
---
  def self.coop_member_details(coop_members)
    includes(coop_members: :coop_branch).where(coop_members: { id: coop_members.ids }).order(:last_name)