app/controllers/concerns/counter.rb

		def counters
			@batch_count = @group_remit.batches.count
			@principal_count = @batches_container.count
			@dependent_count = @batches_dependents.count
			@batch_without_beneficiaries_count = @group_remit.batches_without_beneficiaries.count
---
SELECT COUNT(*) FROM `batches` WHERE `batches`.`group_remit_id` = 3
SELECT COUNT(*) FROM `batches` WHERE `batches`.`group_remit_id` = 3 AND `batches`.`id` NOT IN (SELECT `batches`.`id` FROM `batches` INNER JOIN `batch_beneficiaries` ON `batch_beneficiaries`.`batch_id` = `batches`.`id` WHERE `batches`.`group_remit_id` = 3)